{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "JSON report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend source files.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, dark mode variables, and base styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component managing active tab state and rendering corresponding feature views.",
  "frontend/src/components/mediaai/MediaAiShell.tsx": "Layout shell with collapsible sidebar, dynamic header, and main content area for tabs.",
  "frontend/src/components/mediaai/SidebarNavItem.tsx": "Button component for sidebar navigation with active and collapsed states.",
  "frontend/src/features/image-maker/components/ImageEditorOverlay.tsx": "Full-screen editing overlay showing selected image, edit prompt, suggestions, and save/cancel actions.",
  "frontend/src/features/image-maker/components/ImageGalleryGrid.tsx": "Responsive grid displaying generated images with hover actions and selection handling.",
  "frontend/src/features/image-maker/components/SuggestionChips.tsx": "Renders a button to fetch edit suggestions and displays suggestion chips that trigger a callback when clicked.",
  "frontend/src/features/image-maker/ImageMakerView.tsx": "Image Maker view handling prompt input, image generation, gallery management, and editor overlay logic.",
  "frontend/src/features/video-studio/VideoStudioView.tsx": "UI for a video slideshow creator with placeholder handlers for adding photos and generating a video.",
  "frontend/src/features/voice-over/VoiceOverView.tsx": "Provides an interface to generate a voiceover script via a stub and preview audio with non-functional UI controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context provider and hook for managing authentication state and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that backend data operations are handled client-side.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and forces dark mode by default.",
  "frontend/src/lib/aiStubs.ts": "Local stub functions simulating AI prompt enhancement, image generation, and edit suggestions without external API calls.",
  "frontend/src/main.tsx": "App entry point that mounts React, providing QueryClient and InternetIdentity context.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, plugins, and extensive OKLCH-based color definitions.",
  "project_state.json": "Contains project metadata, architectural notes, and a list of implemented features for the MediaAI React app. Defines current project capabilities, versioning, and build requirements without code."
}